{
  "@context": "https://schema.org",
  "@type": "FAQPage",
  "mainEntity": [
    {
      "@type": "Question",
      "name": "What Web3 events are happening in major Indian cities?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "We list events across all major tech hubs in India. The city filters at the top let you view events in Bangalore, Mumbai, Delhi NCR, Pune, Hyderabad, Chennai, and over 10 other cities. Each listing shows the city, date, and venue details you need."
      }
    },
    {
      "@type": "Question",
      "name": "How often is the event list updated?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "We update this directory daily. New meetups, hackathons, and conferences are added as soon as organizers announce them. Check the 'Last Updated' timestamp at the bottom of the page to see when listings were last refreshed. Follow us on Twitter for real-time announcements."
      }
    },
    {
      "@type": "Question",
      "name": "How do I submit my Web3 event to the listing?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "Click the 'Submit Event' button at the top to add your Web3 meetup, hackathon, or conference. We accept events from all Indian cities. Include the event date, city, venue details, and registration link. Events are typically added within 24 hours."
      }
    },
    {
      "@type": "Question",
      "name": "Can I filter events by city?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "Yes. Use the city filter buttons below the header to instantly filter events. Click a city name to see only those events, or click 'Others' for events in Pune, Hyderabad, Chennai, and more. The filter works without reloading the page."
      }
    },
    {
      "@type": "Question",
      "name": "Are these Web3 events free or paid?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "It varies by event type. Most community meetups and networking events are free to attend. Hackathons typically have free registration but may require applications. Conferences and multi-day events often have ticket prices, though early-bird discounts are common. Click through to each event page for specific pricing and registration details."
      }
    },
    {
      "@type": "Question",
      "name": "What are the top Web3 meetup cities in India for 2026?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "India's Web3 community is spread across several major cities: Bangalore - Most active with weekly meetups and major conferences; Mumbai - Strong DeFi and blockchain finance focus; Delhi NCR - Policy discussions and blockchain initiatives; Pune - University-driven developer communities; Hyderabad - Enterprise blockchain and Web3 infrastructure; Chennai - Growing developer ecosystem; Emerging hubs: Ahmedabad, Jaipur, Kochi, and Kolkata."
      }
    }
  ]
}
